JavaScript course given for the students of Éric’s PL course at
Universitad de Chile.

Focus is on PL concepts, especially objects:

Overview of the JS good parts:
- first-class functions
- functions as objects (.call, .apply ... no access to closure though)
- lexical closures
  + pattern: closures as hidden state

- objects as bag of properties
  + no fields/methods dichotomy, just slots
  + dynamic addition/suppression of slots
  + no cloning
  + three ways to create
    - literal
    - factory method and state in closure
    - new + constructor.prototype

- prototypes
  + lookup delegation (late/dynamic binding)
  + semantics of `this` (JS does not have /methods/)
  + bastard notion of class constructors and instances
  + example of JS object hierarchy (Object -> Function)
  + dynamic inheritance
  + example of mode switching with Pacman

Prototypes lead to traits and mixins
- Organizing programs without Classes

Differences with existing approaches:
- Delegated slot update: affect the receiver or the slot owner?
- Multiple inheritance

Meta object goodies:
- getters, setters, Object.defineProperty, freeze, seal ...

Good things coming:
- Proxies
- Generators

** JS object hierarchy

JS primitives have object counterparts:
#+BEGIN_SRC js
  var n = 12;
  var x = Number(12);
  n === x;
#+END_SRC

#+RESULTS:
: true

: Number -> Object -> null

#+BEGIN_SRC js
  var s = " hola  ";
  s.trim();
#+END_SRC

: String -> Object -> null

Functions are objects as well:
#+BEGIN_SRC js
  var f = function() { return 2; }
  f instanceof Function
#+END_SRC

The Function.prototype object has special methods to execute
functions:
#+BEGIN_SRC js
  var f  = function() { return 2; }
  f.call()
#+END_SRC

#+RESULTS:
: 2

: Function -> Object -> null

The Object object defines useful methods for all objects, like
`toString`.

*** Getters/setters
You can define a getter and a setter for a property, to override the
default behavior:
#+BEGIN_SRC js :session *bub*
  var o = {
    get x() { return Math.random(); },
    set x(value) { /* do nothing */ }
  };

  o.x;
  o.x = 12;
  o.x;
#+END_SRC

#+RESULTS:
: 0.7327769713667496

A getter function will be called when the property is accessed, and
the setter is called when the property is assigned to.

You can hide complex behavior disguised as object properties.

Here’s an example of building late mixins using getters:
#+BEGIN_SRC js :session *bub*
    var duck = {
      size: 12,
      swim: function() { return 'swimming'; }
    }

    var o = {};

    lateMixin(o, duck);

    function lateMixin(obj, source) {
      for (var prop in source) {
        (function(prop) {  // IIFE for closing over `prop`
          Object.defineProperty(obj, prop, {
            get: function() { return source[prop]; }
          });
        }(prop))
      }
    }

    o.swim();

    duck.size = 12;
    o.size;
#+END_SRC

#+RESULTS:
: 12

“That’s what __proto__ gives you”.  Yes!  But now you can have both a
__proto__ and any number of late-mixed-in objects!  Poor man’s
multiple inheritance.

